/*
Created by Vadim Shchemelinin aka badger
2010 St.Petersburg

Script for Tochka-U by RHS
*/
private ["_col","_bgr_tochka_prokachka"];
params["_tochka","_type"];

// exit in eden
if(is3DEN)exitWith{};

if (_type == 1) then {//прокачка рулей, запуск двигателя
	_col=[0.01,0.01,0.01];
	_c1=_col select 0;
	_c2=_col select 1;
	_c3=_col select 2;
	_bgr_tochka_prokachka3 = "#particlesource" createVehicleLocal getpos _tochka;
	_bgr_tochka_prokachka3 setParticleParams [
				["\a3\data_f\ParticleEffects\Universal\Universal", 16, 7, 8, 0],	//название модели
				"","Billboard",1,		//Период таймера частицы, с. Каждые несколько секунд, указанных в этом параметре, запускается скрипт, указанный в параметре OnTimer. Например, если указать TimerPeriod = 2, а OnTimer = "script.sqs", то скрипт "script.sqs" будет запускаться каждые 2 секунды.
				5,		//Время жизни частицы, с. Время в течение которой частица витает в воздухе, при завершении которого она исчезает (растворяется).
				[-1.5, 1.1, 0.4],		//Координаты [x, y, z]. Координаты, откуда стартует частица. Это могут быть просто координаты точки (x,y,z) или, если указать в 19-ом параметре объект, то в этом параметре будут указаны координаты относительно этого объекта (также как при команде camSetRelPos для камер, например).
				[-0.2, 0, 0.6],		//Вектор [x, y, z] (относительно объекта) направления частицы. Направление и скорость движения частицы. Например, [0,10,10] направит частицу вперёд и вверх со скоростью 10 м/с
				5,1.281,1,0.15,[0.5, 3.5],	//Размер частицы (м). (с течением времени)
				[[_c1, _c2, _c3, 0.2], [_c1, _c2, _c3, 0.11], [_c1, _c2, _c3, 0]],		//Цвет частицы (RGBA). "RGB" - это палитра цветов RGB, а "A" - это альфа-свойство, т.е. уровень прозрачности. 0 - полностью прозрачен, 1 - непрозрачен. Например, в фотошопе RGB [255,0,0] означает ярко-красный цвет (можете проверить в фотошопе, палитра color (Window=>Color), покрутите ползунки). В команде drop это же будет выглядеть так: [1,0,0,1]. 1 означает макимальную насыщенность данного цвета. Все значения от 0 до 1.
				[0,1],1,0.04,"","",_tochka		//Объект, связанный с частицей (пишите без кавычек), см. параметр Position.
	];
	_bgr_tochka_prokachka3 setParticleRandom [3,[0.1, 0.1, 0.1],
											 [0.25, 0.25, 0.25],0,0.2,
											 [0, 0, 0, 0],0,0,0];
	_bgr_tochka_prokachka3 setDropInterval 0.75;
	 waitUntil{(_tochka animationPhase 'RHS_SS21_missile_rise' > 0.3)};

	_bgr_tochka_prokachka1 = "#particlesource" createVehicleLocal getpos _tochka;
	_bgr_tochka_prokachka2 = "#particlesource" createVehicleLocal getpos _tochka;
	_bgr_tochka_prokachka1 setParticleParams [
				["\a3\data_f\ParticleEffects\Universal\Universal", 16, 12, 8, 0],	//название модели
				"",		//название анимации
				"Billboard",		//тип частицы
				1,		//Период таймера частицы, с. Каждые несколько секунд, указанных в этом параметре, запускается скрипт, указанный в параметре OnTimer. Например, если указать TimerPeriod = 2, а OnTimer = "script.sqs", то скрипт "script.sqs" будет запускаться каждые 2 секунды.
				12,		//Время жизни частицы, с. Время в течение которой частица витает в воздухе, при завершении которого она исчезает (растворяется).
				[0, -5.1, 0.4],		//Координаты [x, y, z]. Координаты, откуда стартует частица. Это могут быть просто координаты точки (x,y,z) или, если указать в 19-ом параметре объект, то в этом параметре будут указаны координаты относительно этого объекта (также как при команде camSetRelPos для камер, например).
				[0.3, -1.5, -0.8],		//Вектор [x, y, z] (относительно объекта) направления частицы. Направление и скорость движения частицы. Например, [0,10,10] направит частицу вперёд и вверх со скоростью 10 м/с
				5,		//Частота вращения частицы, в Гц.
				1.261,		//Масса частицы (в кг).
				1,		//Объём частицы (в кубических метрах). Если вы знаете физику, то вам известно, что вес и объём связаны формулой плотность=масса/объём. Если плотность частицы будет равна плотности воздуха, то она зависнет в воздухе. В OFP плотность воздуха равна 1.275 кг/(м в кубе), тогда если объём равен 1, то, если массу указать 1.275, частица зависнет в воздухе. Плотность прямо пропорциональна массе, поэтому если указать массу > 1.275, то частица начнёт падать (плотность частицы больше плотности воздуха), в обратном случае - взлетать.
				0.15,		//Взаимодействие окружающей среды и частицы. 0 - нет взаимодействия.
				[0.5, 1.5, 2.0],	//Размер частицы (м). (с течением времени)
				[[_c1, _c2, _c3, 0.5], [_c1, _c2, _c3, 0.2], [_c1, _c2, _c3, 0]],		//Цвет частицы (RGBA). "RGB" - это палитра цветов RGB, а "A" - это альфа-свойство, т.е. уровень прозрачности. 0 - полностью прозрачен, 1 - непрозрачен. Например, в фотошопе RGB [255,0,0] означает ярко-красный цвет (можете проверить в фотошопе, палитра color (Window=>Color), покрутите ползунки). В команде drop это же будет выглядеть так: [1,0,0,1]. 1 означает макимальную насыщенность данного цвета. Все значения от 0 до 1.
				[0,1],		//Фаза анимации. 0 - начало анимации, 1 - конец. Если написать [0,1] то частица будет анимировать (т.е. клубиться как дымок).
				1,	//Период изменения вектора скорости, сек.
				0.14,	//Величина случайного изменения.
				"",		//Имя запускаемого скрипта (см. параметр TimerPeriod).
				"",		//Имя скрипта, вызываемого сразу после уничтожения частицы
				_tochka		//Объект, связанный с частицей (пишите без кавычек), см. параметр Position.
	];
	_bgr_tochka_prokachka2 setParticleParams [
				["\a3\data_f\ParticleEffects\Universal\Universal", 16, 7, 8, 0],	//название модели
				"","Billboard",1,		//Период таймера частицы, с. Каждые несколько секунд, указанных в этом параметре, запускается скрипт, указанный в параметре OnTimer. Например, если указать TimerPeriod = 2, а OnTimer = "script.sqs", то скрипт "script.sqs" будет запускаться каждые 2 секунды.
				5,		//Время жизни частицы, с. Время в течение которой частица витает в воздухе, при завершении которого она исчезает (растворяется).
				[0, -5.1, 0.4],		//Координаты [x, y, z]. Координаты, откуда стартует частица. Это могут быть просто координаты точки (x,y,z) или, если указать в 19-ом параметре объект, то в этом параметре будут указаны координаты относительно этого объекта (также как при команде camSetRelPos для камер, например).
				[0.3, -1.5, -0.8],		//Вектор [x, y, z] (относительно объекта) направления частицы. Направление и скорость движения частицы. Например, [0,10,10] направит частицу вперёд и вверх со скоростью 10 м/с
				5,1.261,1,0.15,[0.5, 1.5],	//Размер частицы (м). (с течением времени)
				[[_c1, _c2, _c3, 0.5], [_c1, _c2, _c3, 0.2], [_c1, _c2, _c3, 0]],		//Цвет частицы (RGBA). "RGB" - это палитра цветов RGB, а "A" - это альфа-свойство, т.е. уровень прозрачности. 0 - полностью прозрачен, 1 - непрозрачен. Например, в фотошопе RGB [255,0,0] означает ярко-красный цвет (можете проверить в фотошопе, палитра color (Window=>Color), покрутите ползунки). В команде drop это же будет выглядеть так: [1,0,0,1]. 1 означает макимальную насыщенность данного цвета. Все значения от 0 до 1.
				[0,1],1,0.04,"","",_tochka		//Объект, связанный с частицей (пишите без кавычек), см. параметр Position.
	];
	_bgr_tochka_prokachka1 setParticleRandom [0,[0.1, 0.1, 0.1],
											 [0.25, 0.25, 0.25],0,0.2,
											 [0, 0, 0, 0],0,0,0];
	_bgr_tochka_prokachka2 setParticleRandom [0,[0.1, 0.1, 0.1],
											 [0.25, 0.25, 0.25],0,0.2,
											 [0, 0, 0, 0],0,0,0];
	_bgr_tochka_prokachka1 setDropInterval 0.05;
	_bgr_tochka_prokachka2 setDropInterval 0.05;

	_tochka say "RHS_tochkaStart";
	sleep 0.707;
	while {((_tochka animationPhase 'RHS_SS21_missile_hide' < 0.5)and(_tochka animationPhase 'RHS_SS21_missile_rise' > 0.3))} do {
//	while {true} do {
		_tochka say "RHS_tochkaLoop";
		sleep 1.219;
		if (_tochka animationPhase 'RHS_SS21_missile_rise' > 0.9) then {
			deletevehicle _bgr_tochka_prokachka3;
		};
	};
	 deletevehicle _bgr_tochka_prokachka1;
	 deletevehicle _bgr_tochka_prokachka2;
};

if (_type == 2) then {//пуск

	drop [["\ca\Data\ParticleEffects\Universal\Universal",16,2,32], "", "Billboard", 1,(0.1 + random 0.1),
	[0, -5.1, -2.4],
	[0, -2, 0], 0, 10, 7.9, 0.075, [1,3],
	[[1, 1, 1, -2], [1, 1, 1, -2],
	[1, 1, 1, -1], [1, 0.5, 1, -0]],
	[5], 1, 0, "", "", _tochka];

//	[_tochka, [0.455,0.364,0.18]] spawn {
//	[_tochka, [0.412,0.366,0.23]] spawn {
//	[_tochka, [0.464,0.404,0.219]] spawn {

	_col=[0.597,0.511,0.398];
	_c1=_col select 0;
	_c2=_col select 1;
	_c3=_col select 2;

	_bgr_tochka_fireeff = "#particlesource" createVehicleLocal getpos _tochka;
	_bgr_tochka_fireeff setParticleParams [
			["\a3\data_f\ParticleEffects\Universal\Universal", 16, 7, 1, 8],	//название модели
			"",		//название анимации
			"Billboard",		//тип частицы
			0.1,		//Период таймера частицы, с. Каждые несколько секунд, указанных в этом параметре, запускается скрипт, указанный в параметре OnTimer. Например, если указать TimerPeriod = 2, а OnTimer = "script.sqs", то скрипт "script.sqs" будет запускаться каждые 2 секунды.
			60,		//Время жизни частицы, с. Время в течение которой частица витает в воздухе, при завершении которого она исчезает (растворяется).
			[0, -5.1, -2.4],		//Координаты [x, y, z]. Координаты, откуда стартует частица. Это могут быть просто координаты точки (x,y,z) или, если указать в 19-ом параметре объект, то в этом параметре будут указаны координаты относительно этого объекта (также как при команде camSetRelPos для камер, например).
			[0, -0.5, 0.1],		//Вектор [x, y, z] (относительно объекта) направления частицы. Направление и скорость движения частицы. Например, [0,10,10] направит частицу вперёд и вверх со скоростью 10 м/с
			15,		//Частота вращения частицы, в Гц.
			1.278,		//Масса частицы (в кг).
			1,		//Объём частицы (в кубических метрах). Если вы знаете физику, то вам известно, что вес и объём связаны формулой плотность=масса/объём. Если плотность частицы будет равна плотности воздуха, то она зависнет в воздухе. В OFP плотность воздуха равна 1.275 кг/(м в кубе), тогда если объём равен 1, то, если массу указать 1.275, частица зависнет в воздухе. Плотность прямо пропорциональна массе, поэтому если указать массу > 1.275, то частица начнёт падать (плотность частицы больше плотности воздуха), в обратном случае - взлетать.
			0.01,		//Взаимодействие окружающей среды и частицы. 0 - нет взаимодействия.
			[5, 3, 2],	//Размер частицы (м). (с течением времени)
			[[_c1, _c2, _c3, 1], [_c1, _c2, _c3, 1], [_c1, _c2, _c3, 0.5]],		//Цвет частицы (RGBA). "RGB" - это палитра цветов RGB, а "A" - это альфа-свойство, т.е. уровень прозрачности. 0 - полностью прозрачен, 1 - непрозрачен. Например, в фотошопе RGB [255,0,0] означает ярко-красный цвет (можете проверить в фотошопе, палитра color (Window=>Color), покрутите ползунки). В команде drop это же будет выглядеть так: [1,0,0,1]. 1 означает макимальную насыщенность данного цвета. Все значения от 0 до 1.
			[1],		//Фаза анимации. 0 - начало анимации, 1 - конец. Если написать [0,1] то частица будет анимировать (т.е. клубиться как дымок).
			2,	//Период изменения вектора скорости, сек.
			0.01,	//Величина случайного изменения.
			"",		//Имя запускаемого скрипта (см. параметр TimerPeriod).
			"",		//Имя скрипта, вызываемого сразу после уничтожения частицы
			_tochka		//Объект, связанный с частицей (пишите без кавычек), см. параметр Position.
	];
	_bgr_tochka_fireeff setParticleCircle [5, [0, 0, 0]];
	_bgr_tochka_fireeff setParticleRandom [
			0,
			[0, 0, 3],
			[1, 1, 0],
			0,
			0,
			[0, 0, 0, 0],
			0,
			0,
			360
	];
	 _bgr_tochka_fireeff setDropInterval 0.01;
	 sleep 1;
	 deletevehicle _bgr_tochka_fireeff;

};

if (_type == 3) then {//огонь ракеты

	_col = [[0.7,0.7,0.7,1],[0.7,0.7,0.7,0.8],[0.7,0.7,0.7,0.6],[0.8,0.8,0.8,0.4],[0.9,0.9,0.9,0.2], [1,1,1,0]];
	_i=1;
	_no=20+random 3;
	while {_i<_no} do {
		drop [["\ca\Data\ParticleEffects\Universal\Universal", 16, 12, 13, 0], "", "Billboard", 1, 2.5, [0, 0, 0],
		[-0.5+random 1,-2.5*_i + random 1,-0.5+random 1], 1, 1, 0.80, 0.4, [0.5,(0.5*_i)+random 0.5],_col,[0],0.1,0.1,"","",_tochka];
		_i=_i+1;
	};

	[_tochka, [0.9,0.9,0.9]] spawn {
		_sh=_this select 0;
		_col=_this select 1;
		_c1=_col select 0;
		_c2=_col select 1;
		_c3=_col select 2;
		_bgr_rocket_fireeff = "#particlesource" createVehicleLocal getpos _sh;
		_bgr_rocket_fireeff setParticleParams [
//				["\a3\data_f\ParticleEffects\Universal\Universal", 16, 13, 2, 1],	//название модели
				["\a3\data_f\ParticleEffects\Universal\Universal", 16, 0, 9, 1],	//название модели
				"",		//название анимации
				"Billboard",		//тип частицы
				0.02,		//Период таймера частицы, с. Каждые несколько секунд, указанных в этом параметре, запускается скрипт, указанный в параметре OnTimer. Например, если указать TimerPeriod = 2, а OnTimer = "script.sqs", то скрипт "script.sqs" будет запускаться каждые 2 секунды.
				0.07,		//Время жизни частицы, с. Время в течение которой частица витает в воздухе, при завершении которого она исчезает (растворяется).
				[0, 0, 0],		//Координаты [x, y, z]. Координаты, откуда стартует частица. Это могут быть просто координаты точки (x,y,z) или, если указать в 19-ом параметре объект, то в этом параметре будут указаны координаты относительно этого объекта (также как при команде camSetRelPos для камер, например).
				[0, 0, 0],		//Вектор [x, y, z] (относительно объекта) направления частицы. Направление и скорость движения частицы. Например, [0,10,10] направит частицу вперёд и вверх со скоростью 10 м/с
				15,		//Частота вращения частицы, в Гц.
				1.277,		//Масса частицы (в кг).
				1,		//Объём частицы (в кубических метрах). Если вы знаете физику, то вам известно, что вес и объём связаны формулой плотность=масса/объём. Если плотность частицы будет равна плотности воздуха, то она зависнет в воздухе. В OFP плотность воздуха равна 1.275 кг/(м в кубе), тогда если объём равен 1, то, если массу указать 1.275, частица зависнет в воздухе. Плотность прямо пропорциональна массе, поэтому если указать массу > 1.275, то частица начнёт падать (плотность частицы больше плотности воздуха), в обратном случае - взлетать.
				0,		//Взаимодействие окружающей среды и частицы. 0 - нет взаимодействия.
				[3, 5],	//Размер частицы (м). (с течением времени)
				[[_c1, _c2, _c3, 1], [_c1, _c2, _c3, 0.7], [_c1, _c2, _c3, 0]],		//Цвет частицы (RGBA). "RGB" - это палитра цветов RGB, а "A" - это альфа-свойство, т.е. уровень прозрачности. 0 - полностью прозрачен, 1 - непрозрачен. Например, в фотошопе RGB [255,0,0] означает ярко-красный цвет (можете проверить в фотошопе, палитра color (Window=>Color), покрутите ползунки). В команде drop это же будет выглядеть так: [1,0,0,1]. 1 означает макимальную насыщенность данного цвета. Все значения от 0 до 1.
				[0,1],		//Фаза анимации. 0 - начало анимации, 1 - конец. Если написать [0,1] то частица будет анимировать (т.е. клубиться как дымок).
				2,	//Период изменения вектора скорости, сек.
				0.01,	//Величина случайного изменения.
				"",		//Имя запускаемого скрипта (см. параметр TimerPeriod).
				"",		//Имя скрипта, вызываемого сразу после уничтожения частицы
				_sh		//Объект, связанный с частицей (пишите без кавычек), см. параметр Position.
		];
		_bgr_rocket_fireeff setParticleCircle [0, [0, 0, 0]];
		_bgr_rocket_fireeff setParticleRandom [
				0,
				[0, 0, 0],
				[0, 0, 0],
				0,
				0,
				[0, 0, 0, 0],
				0,
				0,
				0
		];
		_bgr_rocket_fireeff setDropInterval 0.001;
	 };
	 waitUntil{!(alive _tochka)};
	 deletevehicle _bgr_rocket_fireeff;

};
